Question 1
Question: Calculate the correlation between 'MSFT' and 'IBM' returns from a DataFrame of stock returns.

In [2]:
import pandas as pd

# Assuming 'returns' is a DataFrame containing stock returns
returns = pd.DataFrame({
    'MSFT': [0.05, 0.07, -0.01],
    'IBM': [0.04, 0.02, 0.03]
})
returns

   MSFT   IBM
0  0.05  0.04
1  0.07  0.02
2 -0.01  0.03

Answer:

In [3]:
returns["MSFT"].corr(returns["IBM"])

-0.2401922307076306

Question 2
Question: Convert the columns B and C from wide to long format.

In [4]:
import pandas as pd

df = pd.DataFrame({
'A': {0: 'a', 1: 'b', 2: 'c'},
'B': {0: 1, 1: 3, 2: 5},
'C': {0: 2, 1: 4, 2: 6}
})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

Answer:

In [17]:
pd.melt(df, id_vars="A", value_vars=["B","C"])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

Question 3
Question: Slice the Series to return data from 5th to 15th January.

In [8]:
import pandas as pd
import numpy as np

dates = pd.date_range("2023-01-01", "2023-01-31")
data = pd.Series(np.random.rand(len(dates)), index=dates)

data

2023-01-01    0.365237
2023-01-02    0.134450
2023-01-03    0.769951
2023-01-04    0.827764
2023-01-05    0.315864
2023-01-06    0.809023
2023-01-07    0.891508
2023-01-08    0.827393
2023-01-09    0.197178
2023-01-10    0.546578
2023-01-11    0.637627
2023-01-12    0.909596
2023-01-13    0.971623
2023-01-14    0.621531
2023-01-15    0.122491
2023-01-16    0.960550
2023-01-17    0.604244
2023-01-18    0.403572
2023-01-19    0.769812
2023-01-20    0.670539
2023-01-21    0.656677
2023-01-22    0.192534
2023-01-23    0.517607
2023-01-24    0.963962
2023-01-25    0.391745
2023-01-26    0.850501
2023-01-27    0.304314
2023-01-28    0.822525
2023-01-29    0.479977
2023-01-30    0.363395
2023-01-31    0.719290
Freq: D, dtype: float64

Answer:

In [9]:
data["2023-01-05":"2023-01-15"]

2023-01-05    0.315864
2023-01-06    0.809023
2023-01-07    0.891508
2023-01-08    0.827393
2023-01-09    0.197178
2023-01-10    0.546578
2023-01-11    0.637627
2023-01-12    0.909596
2023-01-13    0.971623
2023-01-14    0.621531
2023-01-15    0.122491
Freq: D, dtype: float64